n = int(input())
gl = []
tab = {}
for i in range(n):
    gl.append(input().split(';'))


tab = {}
for i in gl:
    tab[i[0]] = [0,0,0,0,0]
    tab[i[2]] = [0,0,0,0,0]
    
for i in gl:
    if i[1] > i[3]:
        tab[i[0]][1] = tab[i[0]][1] + 1     #Если выигрывает левая команда + 1 к победам
        tab[i[2]][3] = tab[i[2]][3] + 1     #Если выигрывает левая команда + 1 к поражениям правой
        tab[i[0]][4] = tab[i[0]][4] + 3     #Очки за победу левой команды

    elif i[1] < i[3]:
        tab[i[2]][1] = tab[i[2]][1] + 1     #Если выигрывает правая команда + 1 к победам
        tab[i[0]][3] = tab[i[0]][3] + 1     #Если выигрывает правая команда + 1 к поражениям правой
        tab[i[2]][4] = tab[i[2]][4] + 3     #Очки за победу правой команды

    elif i[1] == i[3]:
        tab[i[0]][2] = tab[i[0]][2] + 1     #если ничья
        tab[i[2]][2] = tab[i[2]][2] + 1
        tab[i[0]][4] = tab[i[0]][4] + 1     #Очки за ничью
        tab[i[2]][4] = tab[i[2]][4] + 1        


    tab[i[0]][0] = tab[i[0]][0] + 1     #счётчик игр
    tab[i[2]][0] = tab[i[2]][0] + 1     #счётчик игр

for keys in tab.keys():
    print(keys + ":", end="")
    for i in tab[keys]:
        print(i, end=' ')
    print()



